Notebook with Filter, Sort and Sortby drill

In [5]:
import pandas as pd
df = pd.DataFrame({"A":[1,2,3,4,5,6],
                  "B": [4,2,5,8,3,2],
                  "C": [1,1,2,4,2,5],
                  "D": ["A","Z","P","M","H","E"]})

display(df)

   A  B  C  D
0  1  4  1  A
1  2  2  1  Z
2  3  5  2  P
3  4  8  4  M
4  5  3  2  H
5  6  2  5  E

Filtering

In [9]:
# The python filter function works on sequences. It doesn't work on a pandas dataframe directly.
l=df.B.tolist()
list(filter(lambda x: x<=4,l))

[4, 2, 3, 2]

In [19]:
# There are numerous ways to filter a pandas data fram. The simplest is to use query.
df.query("D.str.contains('A') or D.str.contains('Z')", engine='python')

   A  B  C  D
0  1  4  1  A
1  2  2  1  Z

In [20]:
df.query("D=='A' or D=='Z'", engine='python')

   A  B  C  D
0  1  4  1  A
1  2  2  1  Z

In [21]:
df.query('D in ["A", "Z", "E"]')

   A  B  C  D
0  1  4  1  A
1  2  2  1  Z
5  6  2  5  E

In [24]:
# Pandas has a filter function that works on the column row or the index
df1 =df.set_index('D')
display(df1)

   A  B  C
D
A  1  4  1
Z  2  2  1
P  3  5  2
M  4  8  4
H  5  3  2
E  6  2  5

In [29]:
df1.filter(items=['A', 'C'])

   A  C
D
A  1  1
Z  2  1
P  3  2
M  4  4
H  5  2
E  6  5

In [ ]:
df1.filter(items=['A', 'C'])

In [32]:
df1.filter(regex='[APM]', axis=0)

   A  B  C
D
A  1  4  1
P  3  5  2
M  4  8  4

Sorting

In [35]:
df1.sort_values(by='B',axis=0,ascending=False)

   A  B  C
D
M  4  8  4
P  3  5  2
A  1  4  1
H  5  3  2
Z  2  2  1
E  6  2  5

In [36]:
df1.sort_index(ascending=False)

   A  B  C
D
Z  2  2  1
P  3  5  2
M  4  8  4
H  5  3  2
E  6  2  5
A  1  4  1

Python built-in sort and sortby

In [56]:
l = ["A","Z","D","M","O","Y"]
l.sort(reverse=True)
print(l)
cars = ['Ford', 'BMW', 'Volvo']
cars.sort(reverse=True)
print(cars)

['Z', 'Y', 'O', 'M', 'D', 'A']
['Volvo', 'Ford', 'BMW']

In [59]:
l = ["A","Z","D","M","O","Y"]

print(sorted(l))
cars = ['Ford', 'BMW', 'Volvo']
c = sorted(cars)
print(c)

['A', 'D', 'M', 'O', 'Y', 'Z']
['BMW', 'Ford', 'Volvo']